{
  "raw_text": "Justice Morison Gurah\nContact Information:\nMobile: +233553852241 / +233578712319 / +233503603858\nEmail: cwaysimorison@gmail.com / cwaysimorison@outlook.com\nLinkedIn: https://www.linkedin.com/in/justice-gurah-b53b2a245\nGitHub: https://github.com/Cwaysi & https://github.com/PerryMoris\nAddress: Kasoa, Awutu Senya East, Central Region, Ghana\nProfessional Summary:\nPassionate and motivated software engineer with a major in backend development,\ncompleted a comprehensive one-year ALX Software Engineering program. Proficient in\ndesigning and implementing scalable backend systems with hands-on experience in various\nbackend technologies. Strong ability to work collaboratively in a team and adapt to new\nchallenges.\nSkills:\n• Programming Languages: Python, JavaScript, VB.NET, C\n• Frameworks & Libraries: Django, Node.js, Express.js\n• Databases: MSSQL, PostgreSQL, MySQL, SQLite\n• Tools & Platforms: Power BI, Looker Studio, Zapier, KOBO, Git, Docker, RESTful APIs\n• Frontend Technologies: ReactJS, HTML, CSS\n• Soft Skills: Problem-solving, teamwork, communication, adaptability\nTech Projects:\nHospital System (CHS) A full paperless desktop application built with Vb.Net and\nother tools/libraries (being used by 12 hospitals across\nGhana)\nSchool System (CSS) A complete system that streamlines the operation of pre-\ntertiary schools, built with Django(python) and other\nlibraries (being used by 5 schools in Ghana and still\ncounting)\nEar Clinic System (CECS) A system built for Medwin Ear Clinic in Accra Ghana to\ndigitalize their operation. Built with Django(python)\nDjango(python) and other libraries/tools\nRehab System A system built for Livewell Rehab Consult in Accra Ghana\nto digitalize their operation. Built with Django(python)\nDjango(python) and other libraries/tools\nMicrofinance System (CLS) A desktop application built with Vb.Net for small\nmicrofinance businesses to manage loans, deposits, and\nwithdrawals.\nPoint of Sales (CPOS) A robust inventory management system for\nsupermarkets, pharmacies, and other sales shops. Being\nused by 5 businesses in Ghana.\nProject Tracker Application Developed a comprehensive project tracking system to\nmanage tasks, stakeholders, and activities efficiently.\nBuilt with Django for backend and Reactjs for frontend\nFarmer-to-Retailer Built a platform connecting farmers directly to retailers,\nenhancing supply chain efficiency. Built in Django\nIn NaSIA Built basic systems to facilitate some operations like a\nLeave management system, Front Desk (for receiving and\ndispatching letters, and invitation management), basic\naudit system.\nOther basic Systems Built other basic systems in Flutter, Django, and React. All\nin my Github account(private repositories)\nEducation:\nALX Software Engineering Program\nBackend Development Major 2022 - 2023\nUniversity for Development Studies (Wa)\nBachelor of Education in Business Studies (Accounting Option) 2014 - 2018\nWork Experience:\nAssistant Inspector\nNational Schools Inspectorate Authority March 2022 - Present\n• Assist IT team in system development-related tasks\n• Develop inspection tools and assist IT to develop KOBO collect questionnaire\n• Use Zapier and other automation tools to automate some processes in the inspection\nprocess.\n• Generate and Visualize data with Power BI and Looker Studio for comprehensive\nreport\n• Conduct inspections to ensure compliance with Ministry of Education regulations.\n• Quality assured reports from other field inspectors.\nField Installer\nGhana Digital Address Project January 2021 - 2022\n• Trained installers on the application used for the project.\n• Tested application modules before deployed\n• Located properties, installed address plates, and prepared detailed reports.\nProcurement/IT Officer\nJustab Hospital Limited July 2019 - January 2021\n• Built and managed hospital management system now called CHS.\n• Managed procurement and accounting tasks, ensuring accurate financial records and\ninventory management.\nAchievements:\n• Developed a full Hospital management system being used by 12 hospitals in Ghana.\n• Developed desktop and web applications for supermarkets and currently in use.\n• Built a software system for banks and earclinic centers.\n• Built systems to facilitate the operation of some departments in my organization.\n• Developed other systems that can be found in my GitHub repo (private and public)\nReference\nReferees can be provided on request"
}